Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.OverrideProfile Property
 The override profile of the analysis part. In case of tapered profile, only the name is available, and more details are available in the start/end properties of the analysis members.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisCrossSection OverrideProfile { get; set; }
Public Property OverrideProfile As AnalysisCrossSection
	Get
	Set
Property Value
Type: AnalysisCrossSection
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace